In [2]:
import pandas as pd
import numpy as np

In [4]:
load_data = pd.read_csv("/Users/armanshaikh/Desktop/pandas-fundamentals/practice_questions/data.csv")

In [6]:
load_data

,order_id,order_date,customer_id,product,category,price,quantity,city,payment_mode
0,101,2025-01-01,C001,Phone,Electronics,15000,1,Delhi,UPI
1,102,2025-01-01,C002,Laptop,Electronics,55000,1,Mumbai,Credit Card
2,103,2025-01-02,C001,Headphones,Accessories,2000,2,Delhi,UPI
3,104,2025-01-03,C003,Chair,Furniture,3000,1,Bangalore,Debit Card
4,105,2025-01-03,C004,Desk,Furniture,7000,1,Delhi,UPI

In [8]:
# Display first and last 3 rows.
load_data.head(3)

,order_id,order_date,customer_id,product,category,price,quantity,city,payment_mode
2,103,2025-01-02,C001,Headphones,Accessories,2000,2,Delhi,UPI
3,104,2025-01-03,C003,Chair,Furniture,3000,1,Bangalore,Debit Card
4,105,2025-01-03,C004,Desk,Furniture,7000,1,Delhi,UPI

In [9]:
load_data.tail(3)

,order_id,order_date,customer_id,product,category,price,quantity,city,payment_mode
2,103,2025-01-02,C001,Headphones,Accessories,2000,2,Delhi,UPI
3,104,2025-01-03,C003,Chair,Furniture,3000,1,Bangalore,Debit Card
4,105,2025-01-03,C004,Desk,Furniture,7000,1,Delhi,UPI

In [10]:
# Check data types and memory usage.
load_data.dtypes

order_id         int64
order_date      object
customer_id     object
product         object
category        object
price            int64
quantity         int64
city            object
payment_mode    object
dtype: object

In [13]:
# Create a new column total_amount = price * quantity.
load_data["Total_Amount"] = load_data["price"] * load_data["quantity"]
load_data

,order_id,order_date,customer_id,product,category,price,quantity,city,payment_mode,Total_Amount
0,101,2025-01-01,C001,Phone,Electronics,15000,1,Delhi,UPI,15000
1,102,2025-01-01,C002,Laptop,Electronics,55000,1,Mumbai,Credit Card,55000
2,103,2025-01-02,C001,Headphones,Accessories,2000,2,Delhi,UPI,4000
3,104,2025-01-03,C003,Chair,Furniture,3000,1,Bangalore,Debit Card,3000
4,105,2025-01-03,C004,Desk,Furniture,7000,1,Delhi,UPI,7000

In [16]:
# Find:
# Total revenue

load_data["Total_Amount"].sum()

np.int64(84000)

In [18]:
# Average order value
load_data["price"].mean()

np.float64(16400.0)

In [20]:
# List unique cities and payment modes.
print("Unique cities:", load_data["city"].unique())

Unique cities: ['Delhi' 'Mumbai' 'Bangalore']

In [21]:

print("Unique payment modes:", load_data["payment_mode"].unique())

Unique payment modes: ['UPI' 'Credit Card' 'Debit Card']